Repository: ThomasKalten/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/demos.po
Languages: es

source: English
es: Inglés

source: `Русский <https://regex.sorokin.engineer/ru/latest/demos.html>`__
es: `Ruso <https://regex.sorokin.engineer/ru/latest/demos.html>`__

source: `Deutsch <https://regex.sorokin.engineer/de/latest/demos.html>`__
es: `Alemán <https://regex.sorokin.engineer/de/latest/demos.html>`__

source: `Български <https://regex.sorokin.engineer/bg/latest/demos.html>`__
es: `Búlgaro <https://regex.sorokin.engineer/bg/latest/demos.html>`__

source: `Français <https://regex.sorokin.engineer/fr/latest/demos.html>`__
es: `Francés <https://regex.sorokin.engineer/fr/latest/demos.html>`__

source: Demos
es: Población

source: Demo code for `TRegExpr <index.html>`__
es: Código de demostración para `TRegExpr <index.html>`__

source: Introduction
es: Introducción

source: If you don't familiar with regular expression, please, take a look at the `r.e.syntax <regular_expressions.html>`__.
es: Si no está familiarizado con la expresión regular, por favor, eche un vistazo a la &#39;sintaxis&#39; <regular_expressions.html>`__.

source: TRegExpr interface described in `TRegExpr interface <tregexpr.html>`__.
es: Interfaz TRegExpr descrita en la interfaz `TRegExpr <tregexpr.html>`__.

source: `Text2HTML sources <https://github.com/andgineer/TRegExpr/tree/master/examples/Text2HTML>`_
es: `Fuentes Text2HTML <https://github.com/andgineer/TRegExpr/tree/master/examples/Text2HTML>`_

source: Publish plain text as HTML
es: Publicar texto plano como HTML

source: Uses unit `HyperLinksDecorator <https://github.com/andgineer/TRegExpr/blob/master/src/HyperLinksDecorator.pas>`__ that is based on TRegExpr.
es: Usa la unidad `HyperLinksDecorator <https://github.com/andgineer/TRegExpr/blob/master/src/HyperLinksDecorator.pas>`__ que se basa en TRegExpr.

source: This unit contains functions to decorate hyper-links.
es: Esta unidad contiene funciones para decorar hipervínculos.

source: For example, replaces ``www.masterAndrey.com`` with ``<a href="http://www.masterAndrey.com">www.masterAndrey.com</a>`` or ``filbert@yandex.ru`` with ``<a href="mailto:filbert@yandex.ru">filbert@yandex.ru</a>``.
es: Por ejemplo, reemplaza `` www.masterAndrey.com`` por `` <a href="http://www.masterAndrey.com">www.masterAndrey.com</a> `` o ``filbert@yandex.ru`` por ``<a href="mailto:filbert@yandex.ru">filbert@yandex.ru</a>``.

source: function DecorateURLs ( const AText : string; AFlags : TDecorateURLsFlagSet = [durlAddr, durlPath] ) : string; type TDecorateURLsFlags = ( durlProto, durlAddr, durlPort, durlPath, durlBMark, durlParam); TDecorateURLsFlagSet = set of TDecorateURLsFlags; function DecorateEMails (const AText : string) : string;
es: function DecorateURLs (const AText: string; AFlags: TDecorateURLsFlagSet = [durlAddr, durlPath]): string; escriba TDecorateURLsFlags = (durlProto, durlAddr, durlPort, durlPath, durlBMark, durlParam); TDecorateURLsFlagSet = conjunto de TDecorateURLsFlags; función DecorateEMails (const AText: string): string;

source: Value
es: Valor

source: Meaning
es: Sentido

source: Protocol (like ``ftp://`` or ``http://``)
es: Protocolo (como `` ftp: // `` o `` http: // ``)

source: TCP address or domain name (like ``masterAndrey.com``)
es: Dirección TCP o nombre de dominio (como ``masterAndrey.com``)

source: Port number if specified (like ``:8080``)
es: Número de puerto si se especifica (como ``: 8080``)

source: Path to document (like ``index.html``)
es: Ruta al documento (como ``index.html``)

source: Book mark (like ``#mark``)
es: Marca de libro (como `` # mark``)

source: URL params (like ``?ID=2&User=13``)
es: Parámetros de URL (como ``? ID = 2 &amp; User = 13``)

source: Returns input text ``AText`` with decorated hyper links.
es: Devuelve el texto de entrada ``AText`` con hipervínculos decorados.

source: ``AFlags`` describes, which parts of hyper-link must be included into visible part of the link.
es: ``AFlags`` describe qué partes del hipervínculo deben incluirse en la parte visible del enlace.

source: For example, if `AFlags` is ``[durlAddr]`` then hyper link ``www.masterAndrey.com/contacts.htm`` will be decorated as ``<a href="www.masterAndrey.com/contacts.htm">www.masterAndrey.com</a>``.
es: Por ejemplo, si `AFlags` es ``[durlAddr]`` entonces el hipervínculo ``www.masterAndrey.com/contacts.htm`` se decorará como ``<a href="www.masterAndrey.com/contacts.htm">www.masterAndrey.com</a>``.

source: Very simple examples, see comments inside the unit
es: Ejemplos muy simples, ver comentarios dentro de la unidad.

source: Slightly more complex examples, see comments inside the unit
es: Ejemplos un poco más complejos, ver comentarios dentro de la unidad
