Repository: ThomasKalten/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: es

source: English
es: Inglés

source: `Русский <https://regex.sorokin.engineer/ru/latest/faq.html>`__
es: `Ruso <https://regex.sorokin.engineer/ru/latest/faq.html>`__

source: `Deutsch <https://regex.sorokin.engineer/de/latest/faq.html>`__
es: `Alemán <https://regex.sorokin.engineer/de/latest/faq.html>`__

source: `Български <https://regex.sorokin.engineer/bg/latest/faq.html>`__
es: `Búlgaro <https://regex.sorokin.engineer/bg/latest/faq.html>`__

source: `Français <https://regex.sorokin.engineer/fr/latest/faq.html>`__
es: `Francés <https://regex.sorokin.engineer/fr/latest/faq.html>`__

source: FAQ
es: Preguntas más frecuentes

source: I found a terrible bug: TRegExpr raises Access Violation exception!
es: Encontré un error grave: ¡TRegExpr genera la excepción de violación de acceso!

source: **Answer**
es: **Responder**

source: You must create the object before usage. So, after you declared something like:
es: Debe crear el objeto antes de su uso. Entonces, después de que declaraste algo como:

source: do not forget to create the object instance:
es: No te olvides de crear la instancia de objeto:

source: Regular expressions with (?=...) do not work
es: Las expresiones regulares con (? = ...) no funcionan

source: Look ahead is not implemented in the TRegExpr. But in many cases you can easily `replace it with simple subexpressions <regular_expressions.html#lookahead>`_.
es: Mirar al futuro no está implementado en el TRegExpr. Pero en muchos casos puede `reemplazarlo fácilmente con subexpresiones simples <regular_expressions.html#lookahead>`_.

source: Does it support Unicode?
es: ¿Es compatible con Unicode?

source: `How to use Unicode <tregexpr.html#unicode>`__
es: `Cómo usar Unicode <tregexpr.html#unicode>`__

source: Why does TRegExpr return more then one line?
es: ¿Por qué TRegExpr devuelve más de una línea?

source: For example, r.e. ``<font .\*>`` returns the first ``<font``, then the rest of the file including last ``</html>``.
es: Por ejemplo, r.e. ``<font .\*>`` devuelve la primera ``<font``, luego el resto del fichero incluyendo la última ``</html>``.

source: For backward compatibility, `modifier /s <regular_expressions.html#modifier_s>`__ is ``On`` by default.
es: Para compatibilidad con versiones anteriores, `modificador / s <regular_expressions.html#modifier_s>`__ es` `On`` por defecto.

source: Switch it Off and ``.`` will match any but `Line separators <regular_expressions.html#syntax_line_separators>`__ - exactly as you wish.
es: Apáguelo y ``.`` coincidirá con cualquiera, excepto con `Separadores de línea <regular_expressions.html#syntax_line_separators>`__ - exactamente como lo deseas.

source: BTW I suggest ``<font ([^\n>]*)>``, in ``Match[1]`` will be the URL.
es: Por cierto, recomiendo `` <font ([^\n>] *)> ``, en `` Match [1] `` se convierte en la URL.</font>.

source: Why does TRegExpr return more then I expect?
es: ¿Por qué TRegExpr regresa más de lo que esperaba?

source: For example r.e. ``<p>(.+)</p>`` applyed to string ``<p>a</p><p>b</p>`` returns ``a</p><p>b`` but not ``a`` as I expected.
es: Por ejemplo re `` <p> (. +) </p> `` aplicado a la cadena `` <p> una </p><p> segundo </p> `` devuelve `` a </p><p> b`` pero no ``a`` como esperaba.

source: By default all operators works in ``greedy`` mode, so they match as more as it possible.
es: Por defecto, todos los operadores trabajan en modo ``codicioso``, para que coincidan tanto como sea posible.

source: If you want ``non-greedy`` mode you can use ``non-greedy`` operators like ``+?`` and so on or switch all operators into ``non-greedy`` mode with help of modifier ``g`` (use appropriate TRegExpr properties or operator ``?(-g)`` in r.e.).
es: Si quiere el modo `` no codicioso`` puede usar operadores `` no codiciosos`` como ``+?`` Y así sucesivamente o cambiar todos los operadores al modo `` no codicioso`` con la ayuda del modificador ` `g`` (use las propiedades TRegExpr apropiadas o el operador` `? (- g)` `en re).

source: How to parse sources like HTML with help of TRegExpr?
es: Cómo analizar fuentes como HTML con la ayuda de TRegExpr?

source: Sorry folks, but it's nearly impossible!
es: Lo siento amigos, pero es casi imposible!

source: Of course, you can easily use TRegExpr for extracting some information from HTML, as shown in my examples, but if you want accurate parsing you have to use real parser, not r.e.
es: Por supuesto, puedes usar TRegExpr fácilmente para extraer información de HTML, como se muestra en mis ejemplos, pero si deseas un análisis preciso, necesitas usar un analizador real.

source: You can read full explanation in Tom Christiansen and Nathan Torkington ``Perl Cookbook``, for example.
es: Puede leer la explicación completa en Tom Christiansen y Nathan Torkington `` Perl Cookbook``, por ejemplo.

source: In short - there are many structures that can be easy parsed by real parser but cannot at all by r.e., and real parser is much faster to do the parsing, because r.e. doesn't simply scan input stream, it performs optimization search that can take a lot of time.
es: En resumen, hay muchas estructuras que pueden analizarse fácilmente con un analizador real, pero que no se pueden realizar por completo, y el analizador real es mucho más rápido que el análisis, porque no solo escanea el flujo de entrada, realiza una búsqueda de optimización que puede realizar un montón de tiempo.

source: Is there a way to get multiple matches of a pattern on TRegExpr?
es: ¿Hay alguna forma de obtener varias coincidencias de un patrón en TRegExpr?

source: You can iterate matches with ExecNext method.
es: Puede iterar coincidencias con el método ExecNext.

source: If you want some example, please take a look at ``TRegExpr.Replace`` method implementation or at the examples for `HyperLinksDecorator <demos.html>`_
es: Si desea algún ejemplo, consulte la implementación del método ``TRegExpr.Replace`` o los ejemplos de `HyperLinksDecorator <demos.html>`_

source: I am checking user input. Why does TRegExpr return ``True`` for wrong input strings?
es: Estoy comprobando la entrada del usuario. ¿Por qué TRegExpr devuelve ``True`` para las cadenas de entrada incorrectas?

source: In many cases TRegExpr users forget that regular expression is for **search** in input string.
es: En muchos casos, los usuarios de TRegExpr olvidan que la expresión regular es para ** búsqueda ** en la cadena de entrada.

source: So, for example if you use ``\d{4,4}`` expression, you will get success for wrong user inputs like ``12345`` or ``any letters 1234``.
es: Entonces, por ejemplo, si usa la expresión `` \ d {4,4} ``, obtendrá el éxito para las entradas de usuario incorrectas como ``12345`` o `` cualquier letra 1234``.

source: You have to check from line start to line end to ensure there are no anything else around: ``^\d{4,4}$``.
es: Debe verificar desde el inicio de la línea hasta el final de la línea para asegurarse de que no haya nada más alrededor: `` ^ \ d {4,4} $ ``.

source: Why does non-greedy iterators sometimes work as in greedy mode?
es: ¿Por qué los iteradores no codiciosos a veces funcionan como en modo codicioso?

source: For example, the r.e. ``a+?,b+?`` applied to string ``aaa,bbb`` matches ``aaa,b``, but should it not match ``a,b`` because of non-greediness of first iterator?
es: Por ejemplo, ¿se aplica r.e. ``a+?b+? `` A la cadena ``aaa,bbb`` coincide con ``aaa,b``, pero no debe coincidir con ``a,b`` debido a la falta de codicia de primer iterador?

source: This is because of TRegExpr way to work. In fact many others r.e. engines work exactly the same: they performe only ``simple`` search optimization, and do not try to do the best optimization.
es: Esto se debe a la manera de trabajar de TRegExpr. De hecho, muchos otros motores funcionan exactamente de la misma manera: solo realizan la optimización de búsqueda ``simple``, y no intentan hacer la mejor optimización.

source: In some cases it's bad, but in common it's rather advantage then limitation, because of performance and predictability reasons.
es: En algunos casos es malo, pero en general es más una ventaja que una limitación, debido a razones de rendimiento y previsibilidad.

source: The main rule - r.e. first of all try to match from current place and only if that's completely impossible move forward by one char and try again from next position in the text.
es: La regla principal es, en primer lugar, tratar de hacer coincidir desde el lugar actual y solo si eso es completamente imposible avanzar una vez e intentar nuevamente desde la siguiente posición en el texto.

source: So, if you use ``a,b+?`` it'll match ``a,b``. In case of ``a+?,b+?`` it's now not recommended (we add non-greedy modifyer) but still possible to match more then one ``a``, so TRegExpr will do it.
es: Entonces, si usas ``a,b+?`` Coincidirá con ``a,b``. En el caso de ``a+?,b+?`` Ahora no se recomienda (agregamos un modificador no codicioso) pero aún es posible que coincida con más de un ``a``, por lo que TRegExpr lo hará.

source: TRegExpr like Perl's or Unix's r.e. doesn't attempt to move forward and check - would it will be "better" match. Fisrt of all, just because there is no way to say it's more or less good match.
es: TRegExpr como el de Perl o Unix no intenta avanzar y comprobar, sería &quot;mejor&quot; coincidencia. A decir verdad, solo porque no hay manera de decir que sea más o menos una buena combinación.

source: How can I use TRegExpr with Borland C++ Builder?
es: ¿Cómo puedo usar TRegExpr con Borland C ++ Builder?

source: I have a problem since no header file (``.h`` or ``.hpp``) is available.
es: Tengo un problema porque no hay ningún archivo de encabezado (``.h`` o ``.hpp``) disponible.

source: Add ``RegExpr.pas`` to ``bcb`` project.
es: Agregue ``RegExpr.pas`` al proyecto ``bcb``.

source: Compile project. This generates the header file ``RegExpr.hpp``.
es: Compilar proyecto. Esto genera el archivo de encabezado ``RegExpr.hpp``.

source: Now you can write code which uses the ``RegExpr`` unit.
es: Ahora puede escribir código que usa la unidad ``RegExpr``.

source: Don't forget to add ``#include “RegExpr.hpp”`` where needed.
es: No olvide agregar `` #include “RegExpr.hpp” `` donde sea necesario.

source: Don't forget to replace all ``\`` in regular expressions with ``\\`` or redefined `EscChar <tregexpr.html#escchar>`__ const.
es: No se olvide de reemplazar todos los ``\`` en expresiones regulares con ``\\`` o redefinido `EscChar <tregexpr.html#escchar>`__ const.

source: Why many r.e. (including r.e. from TRegExpr help and demo) work wrong in Borland C++ Builder?
es: ¿Por qué muchos re (incluyendo re desde TRegExpr help y demo) funcionan mal en Borland C ++ Builder?

source: The hint is in the previous question ;) Symbol ``\`` has special meaning in ``C++``, so you have to ``escape`` it (as described in previous answer). But if you don't like r.e. like ``\\w+\\\\w+\\.\\w+`` you can redefine the constant ``EscChar`` (in ``RegExpr.pas``). For example ``EscChar = "/"``. Then you can write ``/w+/w+/./w+``, looks unusual but more readable.
es: La sugerencia se encuentra en la pregunta anterior;) El símbolo ``\`` tiene un significado especial en `` C ++ ``, por lo que tiene que ``escapar`` (como se describe en la respuesta anterior). Pero si no te gusta re como ``\\w + \\\\ w + \\. \\ w + `` puedes redefinir la constante ``EscChar`` (en ``RegExpr.pas``). Por ejemplo `` EscChar = &quot;/&quot; ``. Luego puede escribir `` / w + / w + /. / W + ``, parece inusual pero más legible.
