Repository: ThomasKalten/TRegExpr
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: es, fr

source: `Español <https://regex.sorokin.engineer/es/latest/index.html>`__
es: Español

source: Introduction
es: Introducción

source: TRegExpr library implements `regular expressions <regular_expressions.html>`_.
es: La librería TRegExpr implementa expresiones regulares <regular_expressions.html>`_.
fr: La bibliothèque TRegExpr implémente des expressions régulières <regular_expressions.html>`_.

source: Regular expressions are easy to use and powerful tool for sophisticated search and substitution and for template based text check.
es: Las expresiones regulares son una herramienta potente y fácil de usar para la búsqueda y sustitución sofisticadas y para la verificación de texto basada en plantillas.
fr: Les expressions régulières sont un outil puissant et facile à utiliser pour la recherche et la substitution sophistiquées et pour la vérification de texte basée sur des modèles.

source: It is especially useful for user input validation in input forms - to validate e-mail addresses and so on.
es: Es especialmente útil para la validación de entrada de usuario en formularios de entrada: validar direcciones de correo electrónico, etc.
fr: Il est particulièrement utile pour la validation des entrées utilisateur dans les formulaires de saisie - pour valider les adresses électroniques, etc.

source: Also you can extract phone numbers, ZIP-codes etc from web-pages or documents, search for complex patterns in log files and all you can imagine. Rules (templates) can be changed without your program recompilation.
es: También puede extraer números de teléfono, códigos postales, etc. de páginas web o documentos, buscar patrones complejos en los archivos de registro y todo lo que pueda imaginar. Las reglas (plantillas) se pueden cambiar sin la recompilación de su programa.
fr: Vous pouvez également extraire des numéros de téléphone, codes postaux, etc. à partir de pages Web ou de documents, rechercher des modèles complexes dans des fichiers journaux et tout ce que vous pouvez imaginer. Les règles (modèles) peuvent être modifiées sans la recompilation de votre programme.

source: TRegExpr is implemented in pure Pascal. It's included into `Lazarus (Free Pascal) <http://wiki.freepascal.org/Regexpr>`_ project. But also it exists as separate library and can be compiled by Delphi 2-7, Borland C++ Builder 3-6.
es: TRegExpr se implementa en Pascal puro. Está incluido en `Lázaro (Pascal Libre) <http://wiki.freepascal.org/Regexpr>`_ proyecto. Pero también existe como una biblioteca separada y puede ser compilada por Delphi 2-7, Borland C ++ Builder 3-6.
fr: TRegExpr est implémenté en Pascal pur. Il est inclus dans `Lazarus (Free Pascal) <http://wiki.freepascal.org/Regexpr>`_ projet. Mais il existe aussi en tant que bibliothèque séparée et peut être compilé par Delphi 2-7, Borland C ++ Builder 3-6.

source: Reviews
es: Opiniones
fr: Avis

source: `How good the library was met <https://sorokin.engineer/posts/en/regexpstudio_site_is_lunched.html>`_.
es: Que buena fue la biblioteca <https://sorokin.engineer/posts/en/regexpstudio_site_is_lunched.html>`_.
fr: `Comment bien la bibliothèque a été rencontré <https://sorokin.engineer/posts/en/regexpstudio_site_is_lunched.html>`_.

source: Quick start
es: Inicio rápido
fr: Démarrage rapide

source: To use the library just add `the sources <https://github.com/andgineer/TRegExpr/blob/master/src/regexpr.pas>`_ to you project and use the class `TRegExpr <tregexpr.html>`_.
es: Para usar la biblioteca solo agregue `las fuentes <https://github.com/andgineer/TRegExpr/blob/master/src/regexpr.pas>`_ para proyectar y usar la clase` TRegExpr <tregexpr.html>`_.
fr: Pour utiliser la bibliothèque, ajoutez simplement `les sources <https://github.com/andgineer/TRegExpr/blob/master/src/regexpr.pas>`_ vous projetez et utilisez la classe` TRegExpr <tregexpr.html>`_.

source: In the `FAQ <faq.html>`_ you can learn from others users problems.
es: En el `FAQ <faq.html>`_ puedes aprender de los problemas de otros usuarios.
fr: Dans la `FAQ <faq.html>`_ vous pouvez apprendre des problèmes des autres utilisateurs.

source: Ready to run Windows application `REStudio <https://github.com/andgineer/TRegExpr/releases/download/0.952b/restudio.zip>`__ will help you learn and debug regular expressions.
es: Listo para ejecutar la aplicación de Windows `REStudio <https://github.com/andgineer/TRegExpr/releases/download/0.952b/restudio.zip>`__ te ayudará a aprender y depurar expresiones regulares.
fr: Prêt à exécuter l&#39;application Windows `REStudio <https://github.com/andgineer/TRegExpr/releases/download/0.952b/restudio.zip>`__ vous aidera à apprendre et à déboguer les expressions régulières.

source: Feedback
es: Realimentación
fr: Retour d&#39;information

source: If you see any problems, please `create the bug <https://github.com/andgineer/TRegExpr/issues>`_.
es: Si ve algún problema, por favor `cree el error <https://github.com/andgineer/TRegExpr/issues>`_.
fr: Si vous voyez des problèmes, veuillez créer le bogue. <https://github.com/andgineer/TRegExpr/issues>`_.

source: Source code
es: Código fuente
fr: Code source

source: Pure Object Pascal.
es: Puro objeto pascual.

source: `Original version <https://github.com/andgineer/TRegExpr>`_
es: `Versión original <https://github.com/andgineer/TRegExpr>`_
fr: `Version originale <https://github.com/andgineer/TRegExpr>`_

source: `FreePascal fork (GitHub mirror of the SubVersion) <https://github.com/graemeg/freepascal/blob/master/packages/regexpr/src/regexpr.pas>`_
es: `FreePascal fork (espejo GitHub de SubVersion) <https://github.com/graemeg/freepascal/blob/master/packages/regexpr/src/regexpr.pas>`_
fr: `Fourche FreePascal (miroir GitHub de la SubVersion) <https://github.com/graemeg/freepascal/blob/master/packages/regexpr/src/regexpr.pas>`_

source: Documentation
es: Documentación

source: Translations
es: Traducciones
fr: Traductions

source: The documentation is available in English and `Russian <https://regexpr.sorokin.engineer/ru/latest/>`_.
es: La documentación está disponible en inglés y en ruso. <https://regexpr.sorokin.engineer/ru/latest/>`_.
fr: La documentation est disponible en anglais et en russe <https://regexpr.sorokin.engineer/ru/latest/>`_.

source: There are also old translations to German, Bulgarian, French and Spanish. If you want to help to update this old translations please `contact me <https://github.com/andgineer>`_.
es: También hay traducciones antiguas al alemán, búlgaro, francés y español. Si quieres ayudar a actualizar estas traducciones antiguas, por favor, contáctame. <https://github.com/andgineer>`_.
fr: Il existe également d&#39;anciennes traductions en allemand, bulgare, français et espagnol. Si vous voulez aider à mettre à jour ces anciennes traductions, veuillez me contacter. <https://github.com/andgineer>`_.

source: They are already machine-translated and need only proof-reading and may be some copy-pasting from old translations.
es: Ya están traducidos automáticamente y solo necesitan corrección de pruebas, y pueden ser copias de las antiguas traducciones.
fr: Ils sont déjà traduits automatiquement et ne nécessitent que la correction d&#39;épreuves. Il peut s&#39;agir d&#39;un copier-coller d&#39;anciennes traductions.

source: Gratitude
es: Gratitud
fr: Reconnaissance

source: Many features suggested and a lot of bugs founded (and even fixed) by TRegExpr’s contributors.
es: Muchas funciones sugeridas y muchos errores encontrados (e incluso solucionados) por los colaboradores de TRegExpr.
fr: Beaucoup de fonctionnalités suggérées et beaucoup de bugs fondés (et même corrigés) par les contributeurs de TRegExpr.

source: I cannot list here all of them, but I do appreciate all bug-reports, features suggestions and questions that I am receiving from you.
es: No puedo enumerarlos todos, pero aprecio todos los informes de errores, sugerencias de características y preguntas que recibo de usted.
fr: Je ne peux pas tous les énumérer ici, mais j&#39;apprécie tous les rapports de bugs, suggestions de fonctionnalités et questions que je reçois de votre part.

source: Guido Muehlwitz - found and fixed ugly bug in big string processing
es: Guido Muehlwitz: error encontrado y arreglado en el procesamiento de cadenas grandes
fr: Guido Muehlwitz - bogue trouvé et corrigé dans le traitement d&#39;une grosse chaîne

source: Steve Mudford - implemented Offset parameter
es: Steve Mudford - implementó el parámetro Offset
fr: Steve Mudford - Paramètre de décalage implémenté

source: Martin Baur (`www.mindpower.com <http://www.mindpower.com>`__) - German translation, usefull suggestions
es: Martin Baur (`www.mindpower.com <http://www.mindpower.com>`__) - Traducción al alemán, sugerencias útiles
fr: Martin Baur (`www.mindpower.com <http://www.mindpower.com>`__) - traduction allemande, suggestions utiles

source: Simeon Lilov - Bulgarian translation
es: Simeon Lilov - Traducción Búlgaro
fr: Simeon Lilov - traduction en bulgare

source: Juergen Schroth - bug hunting and useful suggestions
es: Juergen Schroth - caza de errores y sugerencias útiles
fr: Juergen Schroth - chasse aux insectes et suggestions utiles

source: Martin Ledoux - French translation
es: Martin Ledoux - Traducción al francés
fr: Martin Ledoux - traduction française

source: Diego Calp, Argentina - Spanish translation
es: Diego Calp, Argentina - Traducción al Español
fr: Diego Calp, Argentine - traduction espagnole

source: `Français <https://regex.sorokin.engineer/fr/latest/index.html>`__
fr: Français
